## Production: cloudfront
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 3 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                             NAME                              |
|--------|---------------------------------------------------------------|
| add    | `aws_route53_health_check.api`                                |
| update | `aws_cloudfront_distribution.api`                             |
|        | `aws_cloudfront_response_headers_policy.security_headers_api` |
|        | `aws_wafv2_regex_pattern_set.valid_uri_paths`                 |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_distribution.api will be updated in-place
  ~ resource "aws_cloudfront_distribution" "api" {
        id                             = "E3JW0APMFZN4DN"
        tags                           = {
            "CostCentre" = "github-secret-scanning-production"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

      ~ default_cache_behavior {
          + cache_policy_id            = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          ~ compress                   = true -> false
          ~ min_ttl                    = 1 -> 0
          + origin_request_policy_id   = "216adef6-5c7f-47e4-b989-5492eafa07d3"
            # (10 unchanged attributes hidden)

          - forwarded_values {
              - headers                 = [
                  - "GITHUB-PUBLIC-KEY-IDENTIFIER",
                  - "GITHUB-PUBLIC-KEY-SIGNATURE",
                ] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }
        }

      ~ ordered_cache_behavior {
          + cache_policy_id            = "4135ea2d-6df8-44a3-9df3-4b5a84be39ad"
          ~ compress                   = true -> false
          + origin_request_policy_id   = "216adef6-5c7f-47e4-b989-5492eafa07d3"
            # (12 unchanged attributes hidden)

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = false -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_cloudfront_response_headers_policy.security_headers_api will be updated in-place
  ~ resource "aws_cloudfront_response_headers_policy" "security_headers_api" {
        id   = "025e0c3f-1502-41d8-878f-5cd397572b1f"
        name = "api-cloudfront-headers"
        # (1 unchanged attribute hidden)

      ~ security_headers_config {
          ~ content_security_policy {
              ~ content_security_policy = "report-uri https://csp-report-to.security.cdssandbox.xyz/report; default-src 'none'; script-src 'self'; script-src-elem https://cdn.jsdelivr.net/npm/swagger-ui-dist@4/ 'sha256-QOOQu4W1oxGqd2nbXbxiA1Di6OHQOLQD+o+G9oWL8YY='; connect-src 'self'; img-src 'self' https://fastapi.tiangolo.com/img/ data: 'unsafe-eval'; style-src 'self'; style-src-elem 'self' https://cdn.jsdelivr.net/npm/swagger-ui-dist@4/; frame-ancestors 'self'; form-action 'self';" -> "report-uri https://csp-report-to.security.cdssandbox.xyz/report; default-src 'none'; script-src 'self'; connect-src 'self'; img-src 'self'; style-src 'self'; frame-ancestors 'self'; form-action 'self';"
                # (1 unchanged attribute hidden)
            }

            # (5 unchanged blocks hidden)
        }
    }

  # aws_route53_health_check.api will be created
  + resource "aws_route53_health_check" "api" {
      + arn               = (known after apply)
      + disabled          = false
      + enable_sni        = (known after apply)
      + failure_threshold = 5
      + fqdn              = "github-secret-scanning.alpha.canada.ca"
      + id                = (known after apply)
      + measure_latency   = false
      + port              = 443
      + regions           = [
          + "us-east-1",
          + "us-west-1",
          + "us-west-2",
        ]
      + request_interval  = 30
      + resource_path     = "/healthcheck"
      + tags              = {
          + "CostCentre" = "github-secret-scanning-production"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "github-secret-scanning-production"
          + "Terraform"  = "true"
        }
      + type              = "HTTPS"
    }

  # aws_wafv2_regex_pattern_set.valid_uri_paths will be updated in-place
  ~ resource "aws_wafv2_regex_pattern_set" "valid_uri_paths" {
      ~ description = "Regex to match the API valid paths" -> "Regex to match the API's valid paths"
        id          = "d9c157c2-5c1f-4aeb-9e9c-da73378334b4"
        name        = "valid-api-paths"
        tags        = {
            "CostCentre" = "github-secret-scanning-production"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
